var odakyuleafiasagamiono65Area='商業施設,ローソン 上鶴間本町五丁目,徒歩,4,290,35.53352806824200,139.4482919288350\n' +
'商業施設,ウェルパーク 上鶴間店,徒歩,4,320,35.53525783650280,139.4472604644170\n' +
'商業施設,セブン-イレブン 相模原上鶴間本町6丁目,徒歩,6,450,35.52943773240020,139.4451533797600\n' +
'商業施設,三和 上鶴間店,徒歩,7,520,35.53720836189520,139.4463466355820\n' +
'商業施設,ココカラファイン 相模大野7丁目店,徒歩,8,640,35.5286752198184,139.442081375727\n' +
'商業施設,クリエイトS・D 相模原上鶴間谷口店,徒歩,8,640,35.5373687045424,139.445110763231\n' +
'商業施設,ユニディ 相模大野店,徒歩,12,920,35.52593119743500,139.4464229490750\n' +
'商業施設,三和 相模大野店,徒歩,12,950,35.53080915457680,139.4384243490750\n' +
'商業施設,相模大野ステーションスクエア,徒歩,13,1020,35.53208354479360,139.4377033490750\n' +
'商業施設,Hibiya-Kadan Style 相模大野ステーションスクエア店,徒歩,13,1020,35.53258848853910,139.4381067644170\n' +
'商業施設,ライフ 上鶴間店,徒歩,15,1130,35.52518013564720,139.4458040490750\n' +
'商業施設,相模大野モアーズ,徒歩,15,1140,35.53267055032300,139.4373882355820\n' +
'商業施設,ミーナ町田,徒歩,15,1180,35.5407179653088,139.448640911135\n' +
'商業施設,ボーノ相模大野,徒歩,16,1270,35.53102972291700,139.4349555337320\n' +
'商業施設,ルミネ町田,徒歩,18,1400,35.54217749865140,139.4460417779100\n' +
'商業施設,町田マルイ,徒歩,18,1400,35.54278965707150,139.4450228067460\n' +
'商業施設,町田ジョルナ,徒歩,18,1410,35.5422733268343,139.447220922206\n' +
'商業施設,町田東急ツインズ,徒歩,18,1440,35.5427550936113,139.446410897761\n' +
'商業施設,町田モディ,徒歩,19,1490,35.54345851508070,139.4451392644170\n' +
'商業施設,小田急百貨店 町田店,徒歩,20,1550,35.54420494285630,139.4450769779100\n' +
'商業施設,南町田グランベリーパーク,自転車,20,3950,35.511235117301965, 139.4709975861726\n' +
'公共機関,谷口児童館,徒歩,4,300,35.53252981965210,139.4440486914030\n' +
'公共機関,相模原市立 上鶴間公民館,徒歩,6,460,35.52939133390030,139.4470391490750\n' +
'公共機関,南消防署上鶴間分署,徒歩,7,550,35.5285178801555,139.442746626983\n' +
'公共機関,中和田交番,徒歩,9,690,35.5276341661968,139.446531547331\n' +
'公共機関,鶴園中和田こどもセンター,徒歩,11,860,35.52904558997960,139.4503882355820\n' +
'公共機関,相模大野パスポートセンター,徒歩,16,1270,35.5315310397751,139.435492585993\n' +
'公共機関,相模原市南区区民課相模大野駅連絡所,徒歩,16,1270,35.53133411562540,139.4351251355820\n' +
'公共機関,ユニコムプラザさがみはら,徒歩,16,1270,35.5306483036351,139.435401079689\n' +
'公共機関,町田市立中央図書館,徒歩,17,1340,35.54062679236410,139.4503024490750\n' +
'公共機関,相模大野図書館,徒歩,19,1480,35.53373064790030,139.4337339490750\n' +
'公共機関,相模原市南区役所,徒歩,24,1860,35.53040274918340,139.4300775490750\n' +
'公共機関,相模原南市民ホール,徒歩,24,1860,35.5303492579677,139.430142449073\n' +
'金融機関,相模原谷口郵便局,徒歩,5,380,35.53585181242140,139.4465695914030\n' +
'金融機関,みずほ銀行 相模大野支店,徒歩,16,1260,35.53118452258010,139.4357278490750\n' +
'金融機関,横浜銀行 東林間支店,徒歩,16,1260,35.53083329216820,139.4350732355820\n' +
'金融機関,りそな銀行 相模大野支店,徒歩,16,1270,35.5316159058304,139.435384299384\n' +
'金融機関,三井住友銀行 相模原支店,徒歩,18,1390,35.5320724363665,139.434506999384\n' +
'金融機関,きらぼし銀行 相模大野支店,徒歩,18,1390,35.5320502329477,139.434739542377\n' +
'金融機関,三菱UFJ銀行町田支店,徒歩,20,1560,35.5439017751241,139.445722939978\n' +
'教育機関,市立谷口小学校（通学指定校）,徒歩,6,450,35.53605480380930,139.4474194490750\n' +
'教育機関,市立谷口中学校（通学指定校）,徒歩,7,500,35.53369730971040,139.4420416797600\n' +
'教育機関,ふじSunSun保育園,徒歩,5,350,35.53007969995730,139.4458253030760\n' +
'教育機関,ふじSunSun保育園 分園ふじベビー,徒歩,5,350,35.53141561869870,139.4479724490730\n' +
'教育機関,市立谷口保育園,徒歩,5,400,35.53192564520610,139.4436933355820\n' +
'教育機関,明徳かみつるま保育園,徒歩,6,480,35.532471136689,139.442157694441\n' +
'教育機関,相模大野雲母保育園,徒歩,7,550,35.52894295884140,139.4428823779100\n' +
'教育機関,南大野幼稚園,徒歩,7,560,35.52825889186290,139.4432008490750\n' +
'教育機関,保育園アリス,徒歩,9,700,35.5299946891324,139.450379110451\n' +
'教育機関,谷口幼稚園,徒歩,11,840,35.53694931003250,139.4430598932530\n' +
'教育機関,まあむキッズ相模大野南口,徒歩,11,840,35.532081659009,139.439573425759\n' +
'教育機関,マミー保育園相模大野,徒歩,12,920,35.5328986992634,139.439045194454\n' +
'教育機関,くぬぎ台保育園分園,徒歩,13,990,35.5319038027086,139.438239839674\n' +
'教育機関,さいわいこども園,徒歩,14,1100,35.526180622097,139.438936215362\n' +
'教育機関,町田ひまわり幼稚園,徒歩,16,1280,35.53661597185480,139.4529631644170\n' +
'教育機関,中和田幼稚園,徒歩,19,1460,35.52809542373120,139.4568245067460\n' +
'公園・スポーツ施設,茨山稲荷神社,徒歩,3,230,35.5323807509745,139.447437186508\n' +
'公園・スポーツ施設,バラ山公園,徒歩,3,240,35.5343928751436,139.447556339953\n' +
'公園・スポーツ施設,谷口第二子どもの広場,徒歩,4,250,35.53260328146230,139.4478497490750\n' +
'公園・スポーツ施設,上鶴間本町５丁目まつのき公園,徒歩,4,260,35.53424137056790,139.4479694644850\n' +
'公園・スポーツ施設,谷口ともだち公園,徒歩,4,270,35.5306571655132,139.444799354351\n' +
'公園・スポーツ施設,谷口南台公園,徒歩,5,360,35.53354541744160,139.4490874067460\n' +
'公園・スポーツ施設,中村さつき公園,徒歩,5,380,35.5317032845766,139.443998449073\n' +
'公園・スポーツ施設,上鶴間本町５丁目ふれあい公園,徒歩,6,430,35.53298638054510,139.4493895355820\n' +
'公園・スポーツ施設,相模大野7丁目アルファベット公園,徒歩,6,460,35.5302945484125,139.442417660046\n' +
'公園・スポーツ施設,下村公園,徒歩,8,620,35.53733960059320,139.4477834355820\n' +
'公園・スポーツ施設,エニタイムフィットネス相模大野南口店,徒歩,8,640,35.52872762792710,139.4420706490750\n' +
'公園・スポーツ施設,相模大野７丁目公園,徒歩,9,690,35.52946243235450,139.4416462509240\n' +
'公園・スポーツ施設,境川ゆっくりロード,徒歩,10,780,35.53231815686580,139.4527398133460\n' +
'公園・スポーツ施設,相模大野南口公園,徒歩,11,850,35.5308549314506,139.439088658375\n' +
'公園・スポーツ施設,ルネサンス 相模大野,徒歩,11,880,35.5301734724163,139.439238301925\n' +
'公園・スポーツ施設,金森山 ふるさとの森,徒歩,13,990,35.53454896146660,139.4518266355820\n' +
'公園・スポーツ施設,原町田青空ひろば,徒歩,15,1200,35.53747553071010,139.4491484779100\n' +
'公園・スポーツ施設,相模大野中央公園,徒歩,18,1440,35.53508151409810,139.4336971932530\n' +
'医療機関,相模大野メディカルヴィレッジ,徒歩,6,470,35.53129148069437, 139.44236735858942\n' +
'医療機関,あおき整形外科,徒歩,6,470,35.53161331077590,139.4427224797600\n' +
'医療機関,さいとう内科医院,徒歩,6,470,35.53130730582581,139.44251353897323\n' +
'医療機関,パークスクエアクリニック,徒歩,8,630,35.53071405479420,139.4414153914030\n' +
'医療機関,木村医院,徒歩,10,790,35.5311780935637,139.439910991445\n' +
'医療機関,わたせ耳鼻咽喉科,徒歩,11,870,35.5323157686939,139.439159309148\n' +
'医療機関,相模大野病院,徒歩,12,920,35.53168882148250,139.4388522644170\n' +
'医療機関,のんのキッズクリニック,徒歩,13,1010,35.52982795068460,139.4372096625680\n' +
'医療機関,上鶴間ファミリークリニック,徒歩,13,1030,35.5279343080017,139.452877302515\n' +
'医療機関,みるるクリニック原町田,徒歩,14,1060,35.5387545207362,139.447995402446\n' +
'医療機関,森下記念病院,徒歩,19,1470,35.52341656742740,139.4366327397500\n' +
'医療機関,相模原南メディカルセンター,徒歩,19,1480,35.53417516201750,139.4343716067460\n' +
'医療機関,東芝林間病院,徒歩,22,1690,35.52036524307580,139.4410968067460';
$(function () {
var markerData_1= [];
var markerData_2= [];
var markerData_3= [];
var markerData_4= [];
var markerData_5= [];
var markerData_6= [];
var markerData_7= [];

var mapstab=1;
var map;
var marker = [];
var infoWindow = [];
var marker0 ;
var markerData_A;
setTimeout(function () {
odakyuleafiasagamiono65Area0();
}, 300);
function initMap_1() {
for (var i = 0; i < markerData_A.length; i++) {
var tempobj =  {
    cname: markerData_A[i][0],
    name: markerData_A[i][1],
    lat: Number(markerData_A[i][5]),
    lng: Number(markerData_A[i][6]),
    icon: 'images/area/pin/point_01.png',
    info1:markerData_A[i][2],
    info2:markerData_A[i][3],
    info3:markerData_A[i][4]
};
switch(markerData_A[i][0]){
    case '商業施設':
        markerData_1.push(tempobj);
        break;
    case '公共機関':
        markerData_2.push(tempobj);
        break;
    case '金融機関':
        markerData_3.push(tempobj);
        break;
    case '教育機関':
        markerData_4.push(tempobj);
        break;
    case '公園・スポーツ施設':
        markerData_5.push(tempobj);
        break;
    case '医療機関':
        markerData_6.push(tempobj);
        break;
}
}


var latlng1 = new google.maps.LatLng(35.532905272071226, 139.44638809086186);
var gmapop1 = {
zoom: 17,
center: latlng1
};
map = new google.maps.Map(document.getElementById('odakyuleafiasagamiono65Area'), gmapop1);
marker0 = new google.maps.Marker({
position: new google.maps.LatLng(35.532905272071226, 139.44638809086186),
// zIndex: 99 ,
icon:
    new google.maps.MarkerImage(
        'images/area/pin/point_01.png',
        new google.maps.Size(180, 105),
        new google.maps.Point(0,0),
        new google.maps.Point(32,105)
    ),
map: map
});
$('.stab').addClass('s1');
setmarker(mapstab);

}
$('.lifeInfoTab li').on('click', function () {
var a = $(this).index();
setmarker(a+1);
});
function markerEvent(i) {
marker[i].addListener('click', function() {
for(var j = 0; j < infoWindow.length; j++){
    infoWindow[j].close() ;
};
infoWindow[i].open(map, marker[i]);
var mmcenter = new google.maps.LatLng( tempdat[i]['lat'], tempdat[i]['lng'] );
map.panTo(mmcenter);
});
}
var tempdat;
var tempdat2;
function mmov(lat,lang){
var movePos = new google.maps.LatLng( lat,lang );
map.panTo(movePos);
}
function setmarker(mapi){
for (var i = 0; i < marker.length; i++) {
marker[i].setMap(null);
}
switch (mapi) {
case 1:
    tempdat = markerData_1;
    tempdat2 = '#FD5658';
    break;
case 2:
    tempdat = markerData_2;
    tempdat2 = '#9C2CAF';
    break;
case 3:
    tempdat = markerData_3;
    tempdat2 = '#FAC13F';
    break;
case 4:
    tempdat = markerData_4;
    tempdat2 = '#785549';
    break;
case 5:
    tempdat = markerData_5;
    tempdat2 = '#189C5A';
    break;
case 6:
    tempdat = markerData_6;
    tempdat2 = '#3B4BA5';
    break;
}
for (var i = 0; i < tempdat.length; i++) {
var  markerLatLng = new google.maps.LatLng({lat: tempdat[i]['lat'], lng: tempdat[i]['lng']});
marker[i] = new google.maps.Marker({
    position: markerLatLng,
    // animation: google.maps.Animation.DROP,
    map: map ,
    icon: {
        url: 'images/area/pin/'+mapi+'_'+(i+1)+'.png',
        scaledSize : new google.maps.Size(30, 40)
    }
});
infoWindow[i] = new google.maps.InfoWindow({
    content: '<div class="gmapf"><h4 style="background-color: '+tempdat2+';color: #fff;margin: 0px;text-align: center; padding-left: 10px;padding-right: 10px;">' + tempdat[i]['name'] + '</h4><p>' + tempdat[i]['info1'] + tempdat[i]['info2'] + '分(約'+tempdat[i]['info3'] +'m)</p></div>'
});
markerEvent(i);
}
map.panTo(new google.maps.LatLng(35.532905272071226, 139.44638809086186));
}
function hiddenAll() {
for(let i = 0; i < infobox.length; i++) {
infobox[i].close(map);
}
}
function odakyuleafiasagamiono65Area0() {
var temparr = [];
var lines = odakyuleafiasagamiono65Area.split("\n");
for (var i = 0; i < lines.length; ++i) {
var col = lines[i].split(",");
if (col.length != 1) {
    temparr.push(col);
}
}
markerData_A =temparr;
initMap_1();
}
});
